/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isflag.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: celadia <celadia@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/11/16 17:59:38 by celadia           #+#    #+#             */
/*   Updated: 2021/11/18 13:41:02 by celadia          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
 * Функция ft_isdigit выполняет проверку на то, является ли символ флагом и
 * возвращает 1 при истинности условия и 0 в ином случае.
 */

int	ft_isflag(int flag)
{
	if (flag == '-' || flag == '+' || flag == '0'
		|| flag == ' ' || flag == '#')
		return (1);
	return (0);
}
